{
  "introduction": [
    {
      "title": "Welcome to our robot factory!",
      "content": [
        "As a supervisor, your task will be assemble and train robots to perform various tasks.",
        "But before you can start, you need to go through mandatory training that will teach you how these robots work."
      ]
    },
    {
      "title": "How do robots learn?",
      "content": [
        "The robots in this facility learn using machine learning techniques, primarily neural networks and reinforcement learning.",
        "To understand how they learn, let's first look at neural networks-one of the core systems powering their decision-making."
      ]
    },
    {
      "title": "What is a neural network?",
      "content": [
        "A neural network is made of layers of connected nodes that transform input data, adjust internal parameters, and improve with training.",
        "This allows the robot to recognize patterns, make decisions, and enhance its performance over time."
      ]
    },
    {
      "title": "Your first task",
      "content": [
        "Before you start to create fully functional robots, you need to prove that you know how to create and use neural networks.",
        "Your first task is to set up a basic neural network and explore its architecture to understand how it processes and learns from data."
      ]
    },
    {
      "title": "Instructions",
      "content": [
        "You can build your neural network in the workshop.",
        "Start by adding nodes to the input and output layers, and include at least one hidden layer with a few nodes.",
        "If you're unsure about any feature, click on the info icon to view an explanation of its purpose."
      ]
    }
  ],
  "firstPuzzleNotSolved": [
    {
      "title": "Task incomplete",
      "content": [
        "The basic neural network has not been set up yet. Return to the workshop and complete the network setup by adding input, hidden, and output layers."
      ]
    }
  ],
  "firstPuzzleSolved": [
    {
      "title": "Task completed!",
      "content": [
        "You set up your first network and learned about network architecture.",
        "Now, you'll will build a network that will power our sorting robot, so that it can classify robot parts into different categories."
      ]
    },
    {
      "title": "Your second task",
      "content": [
        "Each incoming part has three properties: weight, energy consumption, and material type.",
        "Your neural network must analyze these properties and correctly determine whether a part belongs to a Worker, Cleaner or Explorer.",
        "Adjust the network's hidden layers and neurons to achieve the highest classification accuracy."
      ]
    }
  ],
  "secondPuzzleNotSolved": [
    {
      "title": "Task incomplete",
      "content": [
        "The neural network is not yet set up to classify robot parts. Return to the workshop and complete the network setup by adding input, hidden, and output layers."
      ]
    }
  ],
  "secondPuzzleSolved": [
    {
      "title": "Task completed!",
      "content": [
        "You successfully set up a neural network that can classify robot parts.",
        "Now, you'll need to train the network."
      ]
    }
  ],
  "ReinforcementLearning": [
    {
      "title": "What is reinforcement learning?",
      "content": [
        "Reinforcement learning is a type of machine learning where an agent learns to make decisions by interacting with its environment.",
        "The agent receives feedback in the form of rewards or penalties based on its actions, which helps it learn and improve over time."
      ]
    },
    {
      "title": "How does it work?",
      "content": [
        "In reinforcement learning, the agent explores its environment and takes actions to achieve specific goals.",
        "When the agent performs well, it receives positive rewards, reinforcing that behavior. If it makes mistakes, it gets negative rewards, prompting it to adjust its strategy.",
        "Over time, the agent learns to maximize its rewards by finding the best actions to take in different situations."
      ]
    },
    {
      "title": "Your third task",
      "content": [
        "Now that you understand how neural networks and reinforcement learning work, it's time to train your robot.",
        "You will need to set up a reward values that will help the robot learn from its experiences."
      ]
    },
    {
      "title": "Instructions",
      "content": [
        "In this tile-based game, you can set up the reward values for each special tile.",
        "The robot will receive a reward based on the value you set for the tile it steps on.",
        "You can also set the reward value for to zero, which means the robot won't receive any feedback when stepping on it."
      ]
    }
  ],
  "RLPuzzle1": [
    {
      "title": "Level 1",
      "content": [
        "For this level, you need to set up the reward values for the tiles, such that the robot can learn to navigate the environment and reach the goal.",
        "How well your setup performs will be evaluated based on the robot's ability to reach the goal efficiently."
      ]
    }
  ],
  "RLPuzzle2": [
    {
      "title": "Level 2",
      "content": [
        "For this level, you need to set up the reward values for the tiles, such that the robot can learn to defeat its enemies by taking a buff and then attacking them.",
        "How well your setup performs will be evaluated based on the robot's ability defeat both enemies."
      ]
    }
  ],
  "RLPuzzle3": [
    {
      "title": "Level 3",
      "content": [
        "For this level, you need to set up the reward values for the tiles, such that the robot can learn to grab collectibles and reach the goal.",
        "There will be enemies in the level that the robot should try and avoid.",
        "How well your setup performs will be evaluated based on the robot's ability navigate efficiently."
      ]
    }
  ],
  "RLPuzzle1Solved": [
    {
      "title": "Task completed!",
      "content": [
        "You successfully set up the reward values for the tiles, allowing the robot to learn to navigate the environment and reach the goal."
      ]
    }
  ],
  "RLPuzzle1NotSolved": [
    {
      "title": "Task incomplete",
      "content": [
        "The reward values were not optimized for the robot to learn to navigate the environment and reach the goal.",
        "Return to the workshop and give it another try."
      ]
    }
  ],
  "RLPuzzle2Solved": [
    {
      "title": "Task completed!",
      "content": [
        "You successfully set up the reward values for the tiles, allowing the robot to learn to defeat its enemies by taking a buff and then attacking them."
      ]
    }
  ],
  "RLPuzzle2NotSolved": [
    {
      "title": "Task incomplete",
      "content": [
        "The reward values were not optimized for the robot to learn to defeat its enemies by taking a buff and then attacking them.",
        "Return to the workshop and give it another try."
      ]
    }
  ],
  "RLPuzzle3Solved": [
    {
      "title": "Task completed!",
      "content": [
        "You successfully set up the reward values for the tiles, allowing the robot to learn to grab collectibles and reach the goal."
      ]
    }
  ],
  "RLPuzzle3NotSolved": [
    {
      "title": "Task incomplete",
      "content": [
        "The reward values were not optimized for the robot to learn to grab collectibles and reach the goal.",
        "Return to the workshop and give it another try."
      ]
    }
  ]
}
